Тестовая_база_ERP_14/src/Reports/ПредметыКонтролируемыхСделок/ПредметыКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПредметыКонтролируемыхСделок</name>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеДополнительныхПолей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимРасшифровки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Группировка</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипГруппировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Report>

Тестовая_база_ERP_14/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Reports/ПредметыКонтролируемыхСделок/Forms/ФормаИзмененияДанныхПоПредметуСделки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ПредметСделки", ПредметСделки) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Уведомление") Тогда
		ВерсияУведомления_2012 = Параметры.Уведомление.ВерсияУведомления <= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
		Элементы.ГруппаОКВЭД.Видимость = ВерсияУведомления_2012;
		Элементы.ГруппаОКВЭД2.Видимость = Не ВерсияУведомления_2012;
		Элементы.ГруппаОКП.Видимость = ВерсияУведомления_2012;
		Элементы.ГруппаОКПД2.Видимость = Не ВерсияУведомления_2012;
	КонецЕсли;
	
	ОбновитьДанныеФормыПоПредметуСделки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметСделкиПриИзменении(Элемент)
	ОбновитьДанныеФормыПоПредметуСделки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("КодОКВЭД",  КодОКВЭД);
		ЗначенияЗаполнения.Вставить("КодОКВЭД2", КодОКВЭД2);
		ЗначенияЗаполнения.Вставить("КодТНВЭД",  КодТНВЭД);
		ЗначенияЗаполнения.Вставить("КодОКП",    КодОКП);
		ЗначенияЗаполнения.Вставить("КодОКПД2",  КодОКПД2);
		ЗначенияЗаполнения.Вставить("ОблагаетсяНДПИПоПроцентнойСтавке", ОблагаетсяНДПИПоПроцентнойСтавке);
		ОбработатьИзмененияВПредметеСделки(ПредметСделки, ЗначенияЗаполнения);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеФормыПоПредметуСделки(Форма)
	
	СтруктураДанных = ВернутьДанныеПредмета(Форма.ПредметСделки);
	ЗаполнитьЗначенияСвойств(Форма, СтруктураДанных);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, "ГруппаТНВЭД, ГруппаОКП, ГруппаОКПД2, ОблагаетсяНДПИПоПроцентнойСтавке", "Доступность", СтруктураДанных.ЭтоТовар);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьДанныеПредмета(ПредметСделки)
	
	РеквизитыДляЗаполнения = "КодОКВЭД, КодОКВЭД2, КодТНВЭД, КодОКП, КодОКПД2, ОблагаетсяНДПИПоПроцентнойСтавке, ТипНоменклатуры";
	СтруктураВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредметСделки, РеквизитыДляЗаполнения);
	СтруктураВозврата.Вставить("ЭтоТовар", Не СтруктураВозврата.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа
								И Не СтруктураВозврата.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга);
		
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьИзмененияВПредметеСделки(СсылкаНаОбъект, ЗначенияЗаполнения)
		
	ИзменяемыйОбъект = СсылкаНаОбъект.ПолучитьОбъект();
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(СсылкаНаОбъект);
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Попытка
		ЗаполнитьЗначенияСвойств(ИзменяемыйОбъект, ЗначенияЗаполнения);
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Попытка
		ИзменяемыйОбъект.Записать();
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	РазблокироватьДанныеДляРедактирования(СсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти
